// created by R3 SecOps Team <3
// inspired by mRr3b00t
// version 0.1
// Hashes provided via SentinelOne see README
let timeframe = (90d);
search in (DeviceFileEvents, DeviceImageLoadEvents, DeviceNetworkEvents)
TimeGenerated > ago(timeframe)
| where InitiatingProcessSHA1 has_any ("cad1120d91b812acafef7175f949dd1b09c6c21a","bf939c9c261d27ee7bb92325cc588624fca75429","20d554a80d759c50d6537dd7097fed84dd258b3e")
| project TimeGenerated, DeviceName, InitiatingProcessAccountName, InitiatingProcessCommandLine,InitiatingProcessFileName